// Copyright (c) 2019 Christoffer Lerno. All rights reserved.
// Use of this source code is governed by the GNU LGPLv3.0 license
// a copy of which can be found in the LICENSE file.

#include "../utils/common.h"
#include "../utils/errors.h"
#include "../utils/lib.h"
#include "../build/build_options.h"
#include "compiler.h"
#include "enums.h"
#include "target.h"
#include "utils/malloc.h"
#include <float.h>


typedef double Real;

#define MAX_ARRAYINDEX INT32_MAX
typedef uint64_t ByteSize;
typedef uint32_t TypeSize;
typedef int32_t IndexDiff;
typedef int32_t MemberIndex;
typedef uint32_t AlignSize;
typedef int32_t ScopeId;
typedef uint32_t ArraySize;
typedef uint64_t BitSize;


#define MAX_HASH_SIZE (512 * 1024 * 1024)
#define INVALID_SPAN ((SourceSpan){ .row = 0 })
#define MAX_SCOPE_DEPTH 0x100
#define MAX_STRING_BUFFER 0x10000
#define INITIAL_SYMBOL_MAP 0x10000
#define INITIAL_GENERIC_SYMBOL_MAP 0x1000
#define MAX_MACRO_ITERATIONS 0xFFFFFF
#define MAX_PARAMS 512
#define MAX_BITSTRUCT 0x1000
#define MAX_MEMBERS ((MemberIndex)(((uint64_t)2) << 28))
#define MAX_ALIGNMENT ((MemberIndex)(((uint64_t)2) << 28))
#define MAX_TYPE_SIZE UINT32_MAX

typedef struct Ast_ Ast;
typedef struct Decl_ Decl;
typedef struct TypeInfo_ TypeInfo;
typedef struct Expr_ Expr;
typedef struct Module_ Module;
typedef struct Type_ Type;
typedef Type CanonicalType;

typedef unsigned AstId;
typedef unsigned ExprId;
typedef unsigned DeclId;
typedef unsigned TypeInfoId;


typedef struct Int128_
{
	uint64_t high;
	uint64_t low;
} Int128;

typedef struct
{
	Int128 i;
	TypeKind type;
} Int;

typedef struct
{
	Real f;
	TypeKind type;
} Float;

#define UINT128_MAX ((Int128) { UINT64_MAX, UINT64_MAX })
#define INT128_MAX ((Int128) { INT64_MAX, UINT64_MAX })
#define INT128_MIN ((Int128) { (uint64_t)INT64_MIN, 0 })

typedef enum
{
	CONST_INIT_ZERO,
	CONST_INIT_STRUCT,
	CONST_INIT_UNION,
	CONST_INIT_VALUE,
	CONST_INIT_ARRAY,
	CONST_INIT_ARRAY_FULL,
	CONST_INIT_ARRAY_VALUE,
} ConstInitType;



typedef struct ConstInitializer_
{
	ConstInitType kind;
	// Type initialized
	Type *type;
	union
	{
		struct ConstInitializer_ **init_struct;
		Expr *init_value;
		struct
		{
			struct ConstInitializer_ *element;
			MemberIndex index;
		} init_union;
		struct
		{
			struct ConstInitializer_ **elements;
		} init_array;
		struct ConstInitializer_ **init_array_full;
		struct
		{
			struct ConstInitializer_ *element;
			MemberIndex index;
		} init_array_value;
	};
} ConstInitializer;

typedef struct
{
	ConstKind const_kind : 8;
	bool narrowable : 1;
	bool is_character : 1;
	bool is_hex : 1;
	union
	{
		Float fxx;
		Int ixx;
		uint64_t ptr;
		bool b;
		struct
		{
			const char *chars;
			ArraySize len;
		} string;
		Decl *enum_val;
		Decl *err_val;
		struct
		{
			const char *ptr;
			TypeSize len;
		} bytes;
		Type *typeid;
		ConstInitializer *list;
	};
} ExprConst;


typedef uint16_t FileId;
typedef struct
{
	FileId file_id;
	const char *contents;
	char *name;
	char *dir_path;
	const char *full_path;
} File;

typedef union
{
	struct
	{
		FileId file_id;
		unsigned char length;
		unsigned char col;
		uint32_t row;
	};
	uint64_t a;
} SourceSpan;

static_assert(sizeof(SourceSpan) == 8, "Expected 8 bytes");



typedef struct
{
	const char *key;
	void *value;
} SEntry;

typedef struct
{
	uint32_t count;
	uint32_t capacity;
	uint32_t max_load;
	SEntry *entries;
} STable;

typedef struct SEntry2_
{
	const char *key;
	void *value;
	struct SEntry2_ *next;
} HTEntry;

typedef struct
{
	uint32_t mask;
	HTEntry **entries;
} HTable;


typedef struct Path_
{
	SourceSpan span;
	const char *module;
	uint32_t len;
} Path;


typedef struct
{
	unsigned bitsize : 8;
	unsigned bytesize : 8;
	unsigned abi_alignment : 8;
	unsigned pref_alignment : 8;
}  TypeBuiltin;


typedef struct
{
	Type *base;
	ArraySize len;
} TypeArray;


typedef struct
{
	struct FunctionPrototype_ *prototype;
} TypeFunc;

struct Type_
{
	TypeKind type_kind;
	CanonicalType *canonical;
	const char *name;
	Type **type_cache;
	void *backend_type;
	void *backend_typeid;
	void *backend_debug_type;
	union
	{
		// Error, Struct, Union, Typedef, Member
		Decl *decl;
		// int, float, bool
		TypeBuiltin builtin;
		// Type[], Type[*], Type[123], Type[<123>] or Type<[123]>
		TypeArray array;
		// fn Type1(Type2, Type3, ...) throws Err1, Err2, ...
		TypeFunc func;
		// Type*
		Type *pointer;
		// Failable
		Type *failable;
		// Bitstruct
		Type *bitstruct;
	};
};

typedef enum
{
	TYPE_COMPRESSED_NONE = 0,
	TYPE_COMPRESSED_PTR = 1,
	TYPE_COMPRESSED_SUB = 2,
	TYPE_COMPRESSED_SUBPTR = 3,
	TYPE_COMPRESSED_PTRPTR = 4,
	TYPE_COMPRESSED_PTRSUB = 5,
	TYPE_COMPRESSED_SUBSUB = 6,
} TypeInfoCompressedKind;

struct TypeInfo_
{
	ResolveStatus resolve_status : 3;
	TypeInfoKind kind : 6;
	bool failable : 1;
	TypeInfoCompressedKind subtype : 4;
	Type *type;
	SourceSpan span;

	union
	{
		struct
		{
			const char *name;
			Path *path;
		} unresolved;
		Expr *unresolved_type_expr;
		struct
		{
			TypeInfo *base;
			Expr *len;
		} array;
		TypeInfo *pointer;
	};
};


typedef struct
{
	Path *path;
	const char *name;
	SourceSpan span;
	AttributeType attr_kind : 8;
	bool is_custom : 1;
	Expr **exprs;
} Attr;

typedef struct
{
	Path *path;
	bool private;
	Module *module;
} ImportDecl;

typedef struct
{
	TypeSize size;
	Decl **members;
	MemberIndex union_rep;
	AlignSize padding : 16;
} StructDecl;


typedef struct
{
	TypeInfo *base_type;
	Decl **members;
	bool msb0 : 1;
	bool big_endian : 1;
	bool little_endian : 1;
	bool overlap : 1;
} BitStructDecl;

typedef struct VarDecl_
{
	VarDeclKind kind : 8;
	bool unwrap : 1;
	bool shadow : 1;
	bool vararg : 1;
	bool vararg_implicit : 1;
	bool is_static : 1;
	bool is_read : 1;
	bool not_null : 1;
	bool may_not_read : 1;
	bool may_not_write : 1;
	bool is_written : 1;
	bool is_addr : 1;
	bool is_threadlocal : 1;
	bool no_init : 1;
	TypeInfo *type_info;
	union
	{
		Expr *init_expr;
		Decl *alias;
	};
	union
	{
		int32_t index;
		struct
		{
			struct SemaContext_ *context;
			SourceSpan span;
		} hash_var;
		unsigned scope_depth; // CT var
		struct
		{
			void *backend_debug_ref;
			union
			{
				// Variable
				void *failable_ref;
				int tb_failable_reg;
			};
		};
		struct
		{
			union
			{
				struct
				{
					Expr *start;
					Expr *end;
				};
				struct
				{
					unsigned start_bit;
					unsigned end_bit;
				};
			};
		};
	};
} VarDecl;


typedef struct
{
	Expr *expr;
	Decl **then;
	Decl *elif;
} CtIfDecl;

typedef struct
{
	Expr *expr;
	Decl **cases;
} CtSwitchDecl;

typedef struct
{
	Expr *expr;
	Expr *to_expr;
	Decl **body;
} CtCaseDecl;

typedef struct
{
	Expr **args;
	uint32_t ordinal;
	DeclId parent;
} EnumConstantDecl;


typedef struct
{
	Decl** values;
	Decl** parameters;
	TypeInfo *type_info;
} EnumDecl;

typedef enum
{
	VARIADIC_NONE,
	VARIADIC_TYPED,
	VARIADIC_ANY,
	VARIADIC_RAW,
} Variadic;


typedef struct FunctionSignature_
{
	Variadic variadic : 3;
	bool has_default : 1;
	bool use_win64 : 1;
	bool is_pure : 1;
	CallABI abi : 8;
	TypeInfoId returntype;
	Decl** params;
} FunctionSignature;



typedef struct
{
	struct
	{
		bool attr_noreturn : 1;
		bool attr_inline : 1;
		bool attr_noinline : 1;
		bool attr_extname : 1;
		bool attr_naked : 1;
		bool attr_nodiscard : 1;
		bool attr_maydiscard: 1;
	};
	TypeInfoId type_parent;
	FunctionSignature function_signature;
	AstId body;
	AstId docs;
} FuncDecl;

typedef struct
{
	Decl **params;
	Attr **attrs;
} AttrDecl;

typedef struct
{
	bool is_func : 1;
	bool is_distinct : 1;
	union
	{
		FunctionSignature function_signature;
		TypeInfo *type_info;
	};
} TypedefDecl;


typedef struct
{
	union
	{
		TypedefDecl typedef_decl;
		Type *base_type;
	};
} DistinctDecl;

typedef struct
{
	struct
	{
		bool attr_noreturn : 1;
		bool attr_nodiscard : 1;
		bool attr_maydiscard : 1;
	};
	TypeInfoId type_parent; // May be 0
	TypeInfoId rtype; // May be 0
	AstId body;
	DeclId body_param;
	Decl **parameters;
	struct CompilationUnit_ *unit;
	AstId docs;
} MacroDecl;

typedef struct
{
	struct Ast_ **cases;
	Decl **parameters;
	Decl **body_parameters;
	TypeInfoId rtype; // May be 0!
	Path *path; // For redefinition
} GenericDecl;

typedef enum
{
	DEFINE_TYPE_GENERIC,
	DEFINE_IDENT_ALIAS,
	DEFINE_IDENT_GENERIC,
} DefineType;

typedef struct
{
	DefineType define_kind: 5;
	union
	{
		struct
		{
			union
			{
				TypeInfo *type_info;
				struct
				{
					Path *path;
					const char *ident;
					SourceSpan span;
				};
			};
			TypeInfo **generic_params;
		};
		Decl *alias;
	};
} DefineDecl;

typedef struct
{
	AstId defer;
	bool next_target : 1;
	void *break_target;
	void *continue_target;
	AstId scope_defer;
	AstId parent;
} LabelDecl;


typedef struct
{
	Decl **params;
} BodyParamDecl;

typedef struct Decl_
{
	const char *name;
	const char *extname;
	SourceSpan span;
	DeclKind decl_kind : 7;
	Visibility visibility : 3;
	ResolveStatus resolve_status : 3;
	bool is_packed : 1;
	bool is_substruct : 1;
	bool has_variable_array : 1;
	bool is_value : 1;
	bool is_autoimport : 1;
	bool has_extname : 1;
	bool is_external_visible : 1;
	bool is_weak : 1;
	bool is_maybe_unused : 1;
	bool is_must_use : 1;
	bool will_reflect : 1;
	bool obfuscate : 1;
	bool is_dynamic : 1;
	OperatorOverload operator : 4;
	union
	{
		void *backend_ref;
		int tb_register;
		void *backend_value;
	};
	AlignSize alignment;
	const char *section;
	AlignSize offset : 32;
	AlignSize padding : 32;
	/*	bool is_exported : 1;
	bool is_used : 1;
	bool is_used_public : 1;
	bool has_cname : 1;
	uint32_t alignment : 5;
	union
	{
		uint32_t offset;
		uint32_t counter;
	};
	uint32_t size;*/
	struct CompilationUnit_ *unit;
	Attr** attributes;
	Type *type;
	union
	{
		Decl** decl_list;
		struct
		{
			Decl **methods;
			union
			{
				// Unions, Struct use strukt
				StructDecl strukt;
				// Enums and Fault
				EnumDecl enums;
				DistinctDecl distinct_decl;
				BitStructDecl bitstruct;
			};
		};
		Decl** body_params;
		ImportDecl import;
		VarDecl var;
		LabelDecl label;
		EnumConstantDecl enum_constant;
		FuncDecl func_decl;
		AttrDecl attr_decl;
		TypedefDecl typedef_decl;
		MacroDecl macro_decl;
		GenericDecl generic_decl;
		DefineDecl define_decl;
		CtIfDecl ct_if_decl;
		CtIfDecl ct_elif_decl;
		CtSwitchDecl ct_switch_decl;
		CtCaseDecl ct_case_decl;
		Ast *ct_assert_decl;
		Decl** ct_else_decl;

	};
} Decl;






typedef struct
{
	ExprId cond;
	ExprId then_expr; // May be null for elvis!
	ExprId else_expr;
	bool widen : 1;
} ExprTernary;

typedef struct
{
	ExprId left;
	ExprId right;
	BinaryOp operator : 8;
	bool widen : 1;
} ExprBinary;

typedef struct
{
	Expr* expr;
	UnaryOp operator : 8;
	bool widen : 1;
} ExprUnary;





typedef struct
{
	bool is_type_method : 1;
	bool is_pointer_call : 1;
	bool unsplat_last : 1;
	bool attr_force_inline : 1;
	bool attr_force_noinline : 1;
	bool is_builtin : 1;
	bool is_func_ref : 1;
	bool attr_pure : 1;
	bool result_unused : 1;
	AstId body;
	union
	{
		ExprId function;
		DeclId func_ref;
	};
	Expr **arguments;
	Decl **body_arguments;
} ExprCall;

typedef struct
{
	bool from_back : 1;
	ExprId expr;
	ExprId index;
} ExprSubscript;

typedef struct
{
	bool start_from_back : 1;
	bool end_from_back : 1;
	bool is_lenrange : 1;
	ExprId expr;
	ExprId start;
	ExprId end;
} ExprSlice;

typedef struct
{
	ExprId left;
	ExprId right;
} ExprSliceAssign;

typedef struct
{
	ExprId ptr;
	ExprId type_id;
} ExprVariant;

typedef enum
{
	ACCESS_LEN,
	ACCESS_PTR,
	ACCESS_TYPEOFANY,
	ACCESS_ENUMNAME,
	ACCESS_FAULTNAME,
} BuiltinAccessKind;

typedef struct
{
	BuiltinAccessKind kind : 8;
	ExprId inner;
} ExprBuiltinAccess;
typedef struct
{
	Expr *parent;
	union
	{
		Expr *child;
		Decl *ref;
	};
} ExprAccess;

typedef struct DesignatorElement_
{
	DesignatorType kind : 4;
	union
	{
		const char *field;
		struct
		{
			Expr *index_expr;
			Expr *index_end_expr;
		};
	};
	MemberIndex index;
	MemberIndex index_end;
} DesignatorElement;

typedef struct
{
	DesignatorElement **path;
	Expr *value;
} ExprDesignator;

typedef struct
{
	union
	{
		struct
		{
			Path *path;
			const char *ident;
			bool is_const;
		};
		Decl *decl;
	};
} ExprIdentifier;


typedef struct
{
	const char *identifier;
	bool is_ref : 1;
	bool is_rvalue : 1;
	Decl *decl;
} ExprIdentifierRaw;

typedef struct
{
	bool array : 1;
	Expr *inner;
} ExprFlatElement;

typedef struct
{
	TokenType token_type;
	union
	{
		struct
		{
			Expr *main_var;
			ExprFlatElement *flat_path;
		};
		struct
		{
			TypeInfoId type_from;
			TypeInfoId type_to;
		};
	};
} ExprCtCall;

typedef struct
{
	CastKind kind : 8;
	bool implicit : 1;
	ExprId expr;
	TypeInfoId type_info;
} ExprCast;

typedef struct
{
	Expr **values;
	Decl **declarations;
	Ast *ast;
} ExprBodyExpansion;


typedef struct
{
	void *block_return_exit;
	void *block_failable_exit;
	void *block_error_var;
	void *block_return_out;
} BlockExit;

typedef struct
{
	AstId first_stmt;
	BlockExit **block_exit_ref;
} ExprFuncBlock;


typedef struct
{
	AstId first_stmt;
	Expr **args;
	Decl **params;
	BlockExit **block_exit;
} ExprMacroBlock;



typedef struct
{
	Expr *initializer;
	TypeInfo *type_info;
} ExprCompoundLiteral;

typedef struct
{
	const char *name;
	SourceSpan span;
} Label;

typedef struct
{
	Expr *inner;
	AstId cleanup;
} ExprGuard;


typedef struct
{
	union
	{
		struct
		{
			Expr *variable;
			TypeInfo *type;
		};
		struct
		{
			Decl *decl;
			Expr *lhs;
		};
	};
	Expr **exprs;
} ExprCatchUnwrap;

typedef struct
{
	union
	{
		struct
		{
			Expr *variable;
			TypeInfo *type;
			Expr *init;
		};
		struct
		{
			bool assign_existing : 1;
			Expr *failable;
			union
			{
				Decl *decl;
				Expr *lhs;
			};
		};
	};
} ExprTryUnwrap;

typedef struct
{
	Expr *inner;
} ExprLen;


typedef struct
{
	const char *ident;
	BuiltinFunction builtin;
} ExprBuiltin;

typedef struct
{
	bool is_assign : 1;
	bool is_deref : 1;
	union
	{
		struct
		{
			const char *new_ident;
			SourceSpan span;
			Expr *variant_expr;
		};
		Decl *variable;
	};
} ExprVariantSwitch;

typedef struct
{
	ExprId parent;
	TypeIdInfoKind kind;
} ExprTypeidInfo;

typedef struct
{
	Decl *argc;
	Decl *argv;
} ExprArgv;

struct Expr_
{
	Type *type;
	SourceSpan span;
	ExprKind expr_kind : 8;
	ResolveStatus resolve_status : 4;
	union {
		ExprTypeidInfo typeid_info_expr;
		ExprVariantSwitch variant_switch;           // 32
		ExprCast cast_expr;                         // 12
		ExprVariant variant_expr;
		TypeInfo *type_expr;                        // 8
		ExprConst const_expr;                       // 32
		ExprArgv argv_expr;                         // 16
		ExprGuard rethrow_expr;                     // 16
		Decl *decl_expr;                            // 8
		ExprSliceAssign slice_assign_expr;          // 8
		ExprBinary binary_expr;                     // 12
		ExprTernary ternary_expr;                   // 16
		ExprUnary unary_expr;                       // 16
		Expr** try_unwrap_chain_expr;               // 8
		ExprTryUnwrap try_unwrap_expr;              // 24
		ExprCall call_expr;                         // 32
		ExprSlice slice_expr;                       // 16
		Expr *inner_expr;                           // 8
		ExprBuiltinAccess builtin_access_expr;
		ExprCatchUnwrap catch_unwrap_expr;          // 24
		ExprSubscript subscript_expr;               // 12
		ExprAccess access_expr;                     // 16
		ExprDesignator designator_expr;             // 16
		ExprIdentifier identifier_expr;             // 24
		ExprIdentifierRaw ct_ident_expr;            // 24
		ExprCtCall ct_call_expr;                    // 24
		ExprIdentifierRaw ct_macro_ident_expr;      // 24
		ExprIdentifierRaw hash_ident_expr;          // 24
		TypeInfo *typeid_expr;                      // 8
		ExprBodyExpansion body_expansion_expr;      // 24
		ExprCompoundLiteral expr_compound_literal;  // 16
		Expr** expression_list;                     // 8
		Expr** initializer_list;                    // 8
		Expr** designated_init_list;                // 8
		ExprFuncBlock expr_block;                   // 4
		ExprMacroBlock macro_block;                 // 24
		Expr** cond_expr;                           // 8
		ExprBuiltin builtin_expr;                   // 16
	};
};
//static_assert(sizeof(ExprConst) == 32, "Not expected size");

//static_assert(sizeof(Expr) == 56, "Expr not expected size");

typedef struct
{
	AstId first_stmt;
} AstCompoundStmt;


typedef struct
{
	Expr *expr; // May be NULL
	AstId cleanup;
	BlockExit** block_exit_ref; // For block exits
} AstReturnStmt;

typedef struct
{
	bool has_break : 1;
	bool no_exit : 1;
	bool skip_first : 1;
	bool if_chain : 1;
	Decl *label;
} FlowCommon;



typedef struct
{
	FlowCommon flow;
	union
	{
		struct
		{
			ExprId cond;
			AstId then_body;
			AstId else_body;
		};
		struct
		{
			void *break_block;
		} codegen;
	};
} AstIfStmt;


typedef struct
{
	Expr *expr;
	Expr *to_expr;
	Ast *body;
	void *backend_block;
} AstCaseStmt;


typedef struct
{
	FlowCommon flow;
	union
	{
		struct
		{
			ExprId cond;
			AstId defer;
			Ast **cases;
			Ast *scope_defer;
		};
		struct
		{
			void *retry_block;
			void *exit_block;
			void *retry_var;
		} codegen;
	};
} AstSwitchStmt;

typedef struct
{
	FlowCommon flow;
	union
	{
		struct
		{
			ExprId cond;
			ExprId incr;
			ExprId init;
			AstId body;
		};
		struct
		{
			void *continue_block;
			void *exit_block;
		} codegen;
	};
} AstForStmt;

typedef struct
{
	FlowCommon flow;
	bool index_by_ref : 1;
	bool value_by_ref : 1;
	bool iterator : 1;
	CastKind cast : 8;
	ExprId enumeration;
	AstId body;
	DeclId index;
	DeclId variable;
} AstForeachStmt;

typedef struct
{
	AstId prev_defer;
	AstId body; // Compound statement
} AstDeferStmt;



typedef struct AstCtIfStmt_
{
	Expr *expr;
	Ast *elif;
	AstId then;
} AstCtIfStmt;


typedef struct
{
	Expr *cond;
	Ast **body;
} AstCtSwitchStmt;


typedef struct
{
	const char *index_name;
	const char *value_name;
	SourceSpan index_span;
	SourceSpan value_span;
	AstId body;
	ExprId expr;
} AstCtForeachStmt;


typedef struct
{
	bool is_label : 1;
	bool is_resolved : 1;
	AstId defers;
	union
	{
		Label label;
		AstId ast;
	};
} AstContinueBreakStmt;

typedef struct
{
	AstId defer_id;
	union
	{
		struct
		{
			Label label;
			Expr *expr;
		};
		struct
		{
			AstId case_switch_stmt;
			Expr *switch_expr;
		};
	};
} AstNextcaseStmt;


typedef struct
{
	Expr *expr;
	const char *alias;
	const char *constraints;
} AsmOperand;

typedef struct
{
	AsmOperand *inputs;
	AsmOperand *outputs;
/*	TokenId **clobbers;
	TokenId **labels;*/
} AsmParams;

typedef struct
{
	bool is_volatile : 1;
	bool is_inline : 1;
	bool is_goto : 1;
	Expr *body;
} AstAsmStmt;

typedef struct
{
	bool is_ensure;
	ExprId message;
	ExprId expr;
} AstAssertStmt;


typedef struct
{
	union
	{
		struct
		{
			SourceSpan span;
			TypeInfo *type;
			const char *ident;
		};
		Decl *decl;
	};
} DocOptReturn;

typedef struct AstDocDirective_
{
	SourceSpan span;
	DocDirectiveKind kind : 4;
	union
	{
		struct
		{
			const char *name;
			SourceSpan span;
			InOutModifier modifier : 4;
			bool by_ref : 1;
		} param;
		DocOptReturn *optreturns;
		struct
		{
			Expr *decl_exprs;
			const char *comment;
			const char *expr_string;
		} contract;
		struct
		{
			const char *directive_name;
			const char *rest_of_line;
		} generic;
	};
} AstDocStmt;

typedef struct Ast_
{
	SourceSpan span;
	AstId next;
	AstKind ast_kind : 8;
	union
	{
		FlowCommon flow;                    // Shared struct
		AstAsmStmt asm_stmt;                // 16
		AstCompoundStmt compound_stmt;      // 12
		Decl *declare_stmt;                 // 8
		Expr *expr_stmt;                    // 8
		Decl *var_stmt;                     // 8
		AstReturnStmt return_stmt;          // 16
		AstIfStmt if_stmt;                  // 32
		AstDeferStmt defer_stmt;            // 8
		AstSwitchStmt switch_stmt;          // 40
		AstCaseStmt case_stmt;              // 32
		AstCtSwitchStmt ct_switch_stmt;     // 16
		AstContinueBreakStmt contbreak_stmt;// 24
		AstNextcaseStmt nextcase_stmt;      // 32
		AstForStmt for_stmt;                // 32
		AstForeachStmt foreach_stmt;        // 40
		AstCtIfStmt ct_if_stmt;             // 24
		AstId ct_else_stmt;                 // 4
		AstCtForeachStmt ct_foreach_stmt;   // 40
		AstAssertStmt assert_stmt;          // 16
		AstDocStmt doc_stmt;
	};
} Ast;

//static_assert(sizeof(AstContinueBreakStmt) == 24, "Ooops");
//static_assert(sizeof(Ast) == 56, "Not expected size on 64 bit");

typedef struct Module_
{
	Path *name;
	const char **parameters;

	bool is_external : 1;
	bool is_c_library : 1;
	bool is_exported : 1;
	bool is_generic : 1;
	bool is_private : 1;
	AnalysisStage stage : 6;

	Ast **files; // Asts

	Decl** method_extensions;
	Decl** generic_cache;
	HTable symbols;
	struct CompilationUnit_ **units;
	Module *parent_module;
	Module *top_module;
	Module **sub_modules;
} Module;



typedef struct DynamicScope_
{
	ScopeId scope_id;
	bool allow_dead_code : 1;
	bool jump_end : 1;
	ScopeFlags flags;
	unsigned local_decl_start;
	unsigned current_local;
	AstId defer_last;
	AstId defer_start;
	Ast *in_defer;
	unsigned depth;
} DynamicScope;


typedef struct
{
	const char *lex_start;
	size_t lex_len;
	union
	{
		struct
		{
			const char *string;
